// todo: Даны три переменные a и b и с им присвоены целочисленные значения.
// Необходимо вывести значения по возрастанию.
// Пример:
let a = 10
let b = 7
let c = 8

// Вывод: 7 8 10 
ответ--------------
---------------
var arr = [10,7,8];

arr.sort(function (a, b) {
    return a - b;
});

console.log(arr);
-------------------------------------------

или ответ 2 -------------------
--------------------------------------------
const numbers = [10,7,8];
numbers.sort((a, b) => a - b);
console.log(numbers);