// todo: Сохраните результат шахматной партии в виде двухмерного массива board, называть фигуры можно 
// произвольно, например “black queen”.

const board = [
    ['', '', '', 'black queen', '', '', '', 'white king'],
    ['', '', '', '', '', 'black rook', '', ''],
    ['', '', '', '', '', '', '', ''],
    ['', '', '', '', '', '', '', ''],
    ['', '', '', '', '', '', '', ''],
    ['', '', '', '', '', '', '', ''],
    ['', '', '', '', '', '', '', ''],
    ['', '', '', '', '', '', '', ''],
    ];
